conf/src/InformationRegisters/ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников/ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников</name>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидУчетаВремени</name>
    <type>
      <types>CatalogRef.ЭП_ВидыУчетаВремени</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодРегистрацииДень</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/Enums/ЭП_СтатусыСотрудников/ЭП_СтатусыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭП_СтатусыСотрудников</name>
  <enumValues>
    <name>ИспытательныйСрок</name>
  </enumValues>
  <enumValues>
    <name>Работает</name>
  </enumValues>
  <enumValues>
    <name>Уволен</name>
  </enumValues>
  <enumValues>
    <name>ВременноНеРаботает</name>
  </enumValues>
</mdclass:Enum>

conf/src/Catalogs/ЭП_Сотрудники/ЭП_Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭП_Сотрудники</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ЭП_ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>DefinedType.ПрисоединенныйФайл</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ЭП_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорГПХ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Стажёр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Наставник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.ЭП_ПрограммыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСотрудника</name>
    <type>
      <types>EnumRef.ЭП_СтатусыСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Коментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Департамент</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ЭП_ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ЭП_ДолжностиСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлРезюме</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КОД_ЗУП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаПрофиль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботыИзЗУП</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВИПФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВПЗК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботникВОфисе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаКодРевью</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрейдСотрудника</name>
    <type>
      <types>CatalogRef.ЭП_Грейды</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВОбменеСЗУП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчавствуетВПолученииОкладов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Достижения</name>
    <attributes>
      <name>ВидДостижения</name>
      <type>
        <types>CatalogRef.ЭП_ВидыДостиженийСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлан</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаФакт</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасчетныеПрофили</name>
    <attributes>
      <name>Профиль</name>
      <type>
        <types>CatalogRef.ЭП_ПрофилиРасчетаРезультативности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/Catalogs/ЭП_ВидыУчетаВремени/ЭП_ВидыУчетаВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭП_ВидыУчетаВремени</name>
  <predefined>
    <items>
      <name>НеЯвка</name>
      <description>Не явка</description>
    </items>
    <items>
      <name>Явка</name>
      <description>Явка</description>
    </items>
  </predefined>
  <attributes>
    <name>БуквенныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КОД_ЗУП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

conf/src/CommonModules/ЭП_ЗаполнениеЗатраченныхЧасовПоСотрудникамВызовСервера/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ЭП_ЗаполнениеТабеляСотрудников() Экспорт
	
	ПериодНачало = НачалоМесяца(ТекущаяДата());
	ПериодОкончание = КонецМесяца(ПериодНачало);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭП_Сотрудники.Ссылка КАК Сотрудник,
	|	ЭП_Сотрудники.ГрафикРаботы КАК ГрафикРаботы,
	|	Календари.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	Справочник.ЭП_Сотрудники КАК ЭП_Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Календари КАК Календари
	|		ПО ЭП_Сотрудники.ГрафикРаботы = Календари.Ссылка
	|ГДЕ
	|	ЭП_Сотрудники.СтатусСотрудника В (&ИспытательныйСрок, &Работает)
	|	И ЭП_Сотрудники.ПометкаУдаления = ЛОЖЬ
	|	И НЕ ЭП_Сотрудники.ГрафикРаботы = ЗНАЧЕНИЕ(Справочник.Календари.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сотрудники.Сотрудник КАК Сотрудник,
	|	КалендарныеГрафики.ДатаГрафика КАК ДатаГрафика,
	|	ВТ_Сотрудники.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь,
	|	ВЫБОР
	|		КОГДА КалендарныеГрафики.ДеньВключенВГрафик
	|			ТОГДА &Явка
	|		ИНАЧЕ &НеЯвка
	|	КОНЕЦ КАК ВидУчетаВремени,
	|	СУММА(ВЫБОР
	|			КОГДА КалендарныеГрафики.ДеньВключенВГрафик
	|				ТОГДА КалендариРаспРаботы.КоличествоЧасов
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоЧасов,
	|	СУММА(ВЫБОР
	|			КОГДА КалендарныеГрафики.ДеньВключенВГрафик
	|				ТОГДА ЕСТЬNULL(КалендариРаспРаботыПредПр.КоличествоЧасов, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоЧасовПредпраздичный
	|ПОМЕСТИТЬ ВТ_ДанныеКалендаря
	|ИЗ
	|	ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				КалендариРасписаниеРаботы.Ссылка КАК Календарь,
	|				СУММА(РАЗНОСТЬДАТ(КалендариРасписаниеРаботы.ВремяНачала, КалендариРасписаниеРаботы.ВремяОкончания, СЕКУНДА)) КАК КоличествоЧасов,
	|				КалендариРасписаниеРаботы.НомерДня КАК НомерДня
	|			ИЗ
	|				Справочник.Календари.РасписаниеРаботы КАК КалендариРасписаниеРаботы
	|			
	|			СГРУППИРОВАТЬ ПО
	|				КалендариРасписаниеРаботы.Ссылка,
	|				КалендариРасписаниеРаботы.НомерДня) КАК КалендариРаспРаботы
	|			ПО (ДЕНЬНЕДЕЛИ(КалендарныеГрафики.ДатаГрафика) = КалендариРаспРаботы.НомерДня)
	|				И КалендарныеГрафики.Календарь = КалендариРаспРаботы.Календарь
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				КалендариРасписаниеРаботы.Ссылка КАК Календарь,
	|				СУММА(РАЗНОСТЬДАТ(КалендариРасписаниеРаботы.ВремяНачала, КалендариРасписаниеРаботы.ВремяОкончания, СЕКУНДА)) КАК КоличествоЧасов,
	|				КалендариРасписаниеРаботы.НомерДня КАК НомерДня
	|			ИЗ
	|				Справочник.Календари.РасписаниеРаботы КАК КалендариРасписаниеРаботы
	|			
	|			СГРУППИРОВАТЬ ПО
	|				КалендариРасписаниеРаботы.Ссылка,
	|				КалендариРасписаниеРаботы.НомерДня) КАК КалендариРаспРаботыПредПр
	|			ПО КалендарныеГрафики.Календарь = КалендариРаспРаботыПредПр.Календарь
	|				И (КалендариРаспРаботыПредПр.НомерДня = 0)
	|		ПО ВТ_Сотрудники.ГрафикРаботы = КалендарныеГрафики.Календарь
	|ГДЕ
	|	КалендарныеГрафики.ДатаГрафика МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Сотрудники.Сотрудник,
	|	ВТ_Сотрудники.ПроизводственныйКалендарь,
	|	ВЫБОР
	|		КОГДА КалендарныеГрафики.ДеньВключенВГрафик
	|			ТОГДА &Явка
	|		ИНАЧЕ &НеЯвка
	|	КОНЕЦ,
	|	КалендарныеГрафики.ДатаГрафика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&НачалоПериода КАК ПериодРегистрации,
	|	ВТ_ДанныеКалендаря.Сотрудник КАК Сотрудник,
	|	ВТ_ДанныеКалендаря.ДатаГрафика КАК ПериодРегистрацииДень,
	|	ВЫБОР
	|		КОГДА ДанныеПроизводственногоКалендаря.ВидДня ЕСТЬ NULL
	|			ТОГДА ВТ_ДанныеКалендаря.КоличествоЧасов / 3600
	|		КОГДА ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный)
	|			ТОГДА ВТ_ДанныеКалендаря.КоличествоЧасовПредпраздичный / 3600
	|		ИНАЧЕ ВТ_ДанныеКалендаря.КоличествоЧасов / 3600
	|	КОНЕЦ КАК Часы,
	|	ВТ_ДанныеКалендаря.ВидУчетаВремени КАК ВидУчетаВремени
	|ИЗ
	|	ВТ_ДанныеКалендаря КАК ВТ_ДанныеКалендаря
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|		ПО ВТ_ДанныеКалендаря.ДатаГрафика = ДанныеПроизводственногоКалендаря.Дата
	|			И ВТ_ДанныеКалендаря.ПроизводственныйКалендарь = ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников КАК ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников
	|		ПО ВТ_ДанныеКалендаря.Сотрудник = ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников.Сотрудник
	|			И ВТ_ДанныеКалендаря.ДатаГрафика = ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников.ПериодРегистрацииДень
	|ГДЕ
	|	ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников.Часы ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
	Запрос.УстановитьПараметр("КонецПериода", ПериодОкончание);
	Запрос.УстановитьПараметр("ИспытательныйСрок", Перечисления.ЭП_СтатусыСотрудников.ИспытательныйСрок);
	Запрос.УстановитьПараметр("Работает", Перечисления.ЭП_СтатусыСотрудников.Работает); 
	Запрос.УстановитьПараметр("Явка", Справочники.ЭП_ВидыУчетаВремени.Явка);
	Запрос.УстановитьПараметр("НеЯвка", Справочники.ЭП_ВидыУчетаВремени.НеЯвка); 
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	//Выгрузка = РезультатЗапроса.Выгрузить();
	//НаборДанных = РегистрыСведений.ЭП_ЗатраченныеЧасыПоСотрудникам.СоздатьНаборЗаписей();
	//НаборДанных.Отбор.ПериодРегистрации.Установить(ПериодНачало);
	//НаборДанных.Прочитать();
	//НаборДанных.Загрузить(Выгрузка);
	//НаборДанных.Записать(Ложь); 
	//
	   
	
	Выборка = РезультатЗапроса.Выбрать(); 
	
	Пока Выборка.Следующий() Цикл 
		
		Запись = РегистрыСведений.ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников.СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		
		Запись.Записать();
				
	КонецЦикла;		
	
КонецПроцедуры

#КонецОбласти
